---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.HasCurrent
source: html/12937db0-a828-cbc3-de74-22e79a8e2f31.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.HasCurrent Method

Identifies whether the iterator has a current item.
 There is no current item if the iterator has not started yet or has been done.

## Syntax (C#)
```csharp
public bool HasCurrent()
```

## Returns
True if there is a current item.